tap "homebrew/core"
tap "homebrew/bundle"

brew "editorconfig"
brew "elixir"
brew "elm"
brew "exercism"
brew "fzf"
brew "git"
brew "pinentry"
brew "gnupg"
brew "gpg-agent"
brew "hugo"
brew "jq"
brew "neovim"
brew "nvm"
brew "pinentry-mac"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "rebar@3"
brew "ripgrep"
brew "terraform"
brew "tmux"
brew "travis"
brew "tree"
brew "yarn", args: ["without-node"]
