// Place your settings in this file to overwrite the default settings
{
    // Controls the font family.
    "editor.fontFamily": "mononoki",

    // Controls the font size in pixels.
    "editor.fontSize": 14,

    // Insert snippets when their prefix matches. Works best when 'quickSuggestions' aren't enabled.
    "editor.tabCompletion": "on",

    // Controls how the editor should render whitespace characters, possibilities are 'none', 'boundary', and 'all'. The 'boundary' option does not render single spaces between words.
    "editor.renderWhitespace": "all",

    // Controls auto save of dirty files. Accepted values:  'off', 'afterDelay', 'onFocusChange' (editor loses focus), 'onWindowChange' (window loses focus). If set to 'afterDelay', you can configure the delay in 'files.autoSaveDelay'.
    "files.autoSave": "onFocusChange",

    // When enabled, insert a final new line at the end of the file when saving it.
    "files.insertFinalNewline": true,

    // When enabled, will trim trailing whitespace when saving a file.
    "files.trimTrailingWhitespace": true,

    // Enables commit signing with GPG.
    "git.enableCommitSigning": true,

    // Enable usage data and errors to be sent to Microsoft.
    "telemetry.enableTelemetry": false,

    // Enable crash reports to be sent to Microsoft.
    // This option requires restart to take effect.
    "telemetry.enableCrashReporter": false,

    // Customizes which terminal application to run on OS X.
    "terminal.external.osxExec": "iTerm.app",

    // Controls the font size in pixels of the terminal.
    "terminal.integrated.fontSize": 14,

    // The path of the shell that the terminal uses on OS X.
    "terminal.integrated.shell.osx": "/bin/zsh",

    // Controls font aliasing method in the workbench.
    // - default: Sub-pixel font smoothing. On most non-retina displays this will give the sharpest text
    // - antialiased: Smooth the font on the level of the pixel, as opposed to the subpixel. Can make the font appear lighter overall
    // - none: Disables font smoothing. Text will show with jagged sharp edges
    // - auto: Applies `default` or `antialiased` automatically based on the DPI of displays.
    "workbench.fontAliasing": "auto",

    // Enables macOS Sierra window tabs. Note that changes require a full restart to apply and that native tabs will disable a custom title bar style if configured.
    "window.nativeTabs": true,

    // Controls if folders should open in a new window or replace the last active window.
    // - default: folders will open in a new window unless a folder is picked from within the application (e.g. via the File menu)
    // - on: folders will open in a new window
    // - off: folders will replace the last active window
    // Note that there can still be cases where this setting is ignored (e.g. when using the -new-window or -reuse-window command line option).
    "window.openFoldersInNewWindow": "on",

    // Controls which editor is shown at startup, if none is restored from the previous session. Select 'none' to start without an editor, 'welcomePage' to open the Welcome page (default), 'newUntitledFile' to open a new untitled file (only opening an empty workspace).
    "workbench.startupEditor": "newUntitledFile",

    // Fetches experiments to run from a Microsoft online service.
    "workbench.enableExperiments": false
}
